package days07;

/**
 * @author 이경서
 * @date 2023. 7. 21. - 오후 3:29:10
 * @subject 메소드(함수) 설명
 * @content 1. 정의 : 프로그래밍에서 반복되는 명령어들을 찾아서 별도로 묶어서 필요할 때마다 재사용하도록 만든 것
 * 				2. 함수를 사용하면 프로그램이 구조화됨 -> 유지보수 관리 용이
 * 				3. 함수가 기본이 되는 프로그래밍 방식 : 구조적 프로그래밍
 * 				4. 객체가 기본이 되는 프로그래밍 방식 : 객체 지향적 프로그래밍(OOP)
 * 				5. 메소드(함수)의 선언 형식
 * 					접근지정자 기타제어자 리턴자료형 함수명([매개변수...]) {  }
 * 						접근 + 기타 => 수정자(modifier)
 * 										함수의 원형 = 함수의 프로토타입         
 * 					{ 함수의 몸체(BODY)
 * 						[return 리턴값;]
 * 					}
 * 					6. 함수 3가지 파악 = 기능 + 매개변수 + 리턴값(리턴자료형)
 */

public class Ex08 {
	public static void main(String[] args) {
		
	}
}
